# GetDescription Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..GetDescription Method
IPerformanceAdviserRule Interface See Also
---
Retrieves the description of the rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
string GetDescription()
```

Visual Basic
---
```text
Function GetDescription As String
```

Visual C++
---
```text
String^ GetDescription()
```

# ### Return Value
The description of the rule.
# Remarks
Method should return a brief (one-two sentences) description of the rule. String should be localized.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace